realmcu/HoneyGUI/gui_engine/engine/hw_acc/rtl8773e/acc_rtk_ppe.c
#include <draw_img.h>
#include <stdio.h>
#include <stdint.h>
#include <gui_matrix.h>
#include <rtl_ppe.h>
#include <rtl_imdc.h>
#include <rtl876x_rcc.h>
#include <rtl876x_gdma.h>
#include <dma_channel.h>
#include "trace.h"
#include "rtl876x_gpio.h"
#include "os_mem.h"
#include "rtl876x_pinmux.h"
#include "math.h"
#include "fmc_api_ext.h"
#include "os_sync.h"
#include "hal_imdc.h"


extern void sw_acc_blit(draw_img_t *image, struct gui_dispdev *dc, struct gui_rect *rect);

#define PPE_ACC_MIN_OPA       3
#define PPE_TESS_LENGTH       92

#include "section.h"
#define CACHE_BUF_SIZE           (42 * 1024)
SHM_DATA_SECTION static uint8_t cache_buf1[CACHE_BUF_SIZE];
static uint8_t *cache_buf2;
static uint8_t *cache_buf = cache_buf1;
static uint32_t last_cache_size = 0;
static void change_cache_buf(uint32_t cache_size)
{
    if (cache_buf == cache_buf1)
    {
        cache_buf2 = cache_buf1 + (CACHE_BUF_SIZE - cache_size - 4);
        cache_buf = cache_buf2;
    }
    else if (cache_buf == cache_buf2)
    {
        cache_buf = cache_buf1;
    }
#if F_APP_GUI_USE_PSRAM
    else if ((uint32_t)cache_buf > PSRAM_GUI_HEAP_ADDR)
    {
        gui_lower_free(cache_buf);
        cache_buf = cache_buf1;
    }
#endif
    else
    {
        cache_buf = cache_buf1;
    }
}
static void restore_cache_buf(void)
{
#if F_APP_GUI_USE_PSRAM
    if ((uint32_t)cache_buf > PSRAM_GUI_HEAP_ADDR)
    {
        gui_lower_free(cache_buf);
    }
#endif
    cache_buf = cache_buf1;
}

#if F_APP_GUI_USE_PSRAM
static void cache_on_psram(uint32_t size)
{
    if ((uint32_t)cache_buf > PSRAM_GUI_HEAP_ADDR)
    {
        gui_lower_free(cache_buf);
    }
    cache_buf = gui_lower_malloc(size);
}
#endif

static bool memcpy_by_dma(ppe_rect_t *p_rect, ppe_buffer_t *source)
{
    uint8_t pixel_size = PPE_Get_Pixel_Size(source->format);
    if (p_rect->w * p_rect->h * pixel_size > CACHE_BUF_SIZE)
    {
        return false;
    }
    hal_imdc_dma_info info;
    info.length = p_rect->w * pixel_size;
    info.dst_stride = p_rect->w * pixel_size;
    info.src_stride = source->width * pixel_size;
    info.height = p_rect->h;
    uint32_t start_address = source->address + (p_rect->x + p_rect->y * source->width) * pixel_size;
    hal_dma_copy(&info, (uint8_t *)start_address, cache_buf);
    source->address = (uint32_t)cache_buf;
    return true;
}




static bool memcpy_by_imdc(ppe_rect_t *p_rect, ppe_buffer_t *source)
{
#if !F_APP_GUI_USE_PSRAM
    uint8_t pixel_size = PPE_Get_Pixel_Size(source->format);
    if (p_rect->w * p_rect->h * pixel_size > CACHE_BUF_SIZE)
    {
        return false;
    }
#endif
    hal_imdc_decompress_info info;
    info.start_column = p_rect->x;
    info.end_column = p_rect->x + p_rect->w - 1;
    info.start_line = p_rect->y;
    info.end_line = p_rect->y + p_rect->h - 1;
    info.raw_data_address = source->address;
    if (hal_imdc_decompress(&info, cache_buf))
    {
        source->address = (uint32_t)cache_buf;
        return true;
    }
    else
    {
        return false;
    }
}



void bare_blit_by_dma(ppe_buffer_t *target, ppe_buffer_t *source, ppe_rect_t *src_rect,
                      ppe_rect_t *dst_trans)
{
    uint8_t pixel_size = PPE_Get_Pixel_Size(target->format);
    uint32_t dst_start_address = target->address + (dst_trans->x + dst_trans->y * target->width) *
                                 pixel_size;
    uint32_t src_start_address = source->address + (src_rect->x + src_rect->y * source->width) *
                                 pixel_size;
    hal_imdc_dma_info info;
    info.length = src_rect->w * pixel_size;
    info.src_stride = source->width * pixel_size;
    info.dst_stride = target->width * pixel_size;
    info.height = src_rect->h;
    hal_dma_copy(&info, (uint8_t *)src_start_address, (uint8_t *)dst_start_address);
}

void bare_blit_by_imdc(ppe_buffer_t *target, ppe_buffer_t *source, ppe_rect_t *src_rect,
                       ppe_rect_t *dst_trans)
{
    uint8_t pixel_size = PPE_Get_Pixel_Size(target->format);
    uint32_t dst_start_address = target->address + (dst_trans->x + dst_trans->y * target->width) *
                                 pixel_size;
    hal_imdc_decompress_info info;
    info.start_line = src_rect->y;
    info.end_line = src_rect->y + src_rect->h - 1;
    info.start_column = src_rect->x;
    info.end_column = src_rect->x + src_rect->w - 1;
    info.length = src_rect->w * pixel_size;
    info.dst_stride = target->width * pixel_size;
    info.raw_data_address = source->address;
    hal_imdc_decompress_rect(&info, (uint8_t *)dst_start_address);
}

static float get_x(float *line, float y)
{
    float x;
    if (line[0] == 0)
    {
        x = 0;
    }
    else if (line[1] == 0)
    {
        x = -line[2];
    }
    else
    {
        x = (-line[2] - line[1] * y) / line[0];
    }
    return x;
}

void acc_get_intersect_area(draw_img_t *image, ppe_rect_t *new_rect, ppe_rect_t *dst,
                            struct gui_dispdev *dc)
{
    memcpy(new_rect, dst, sizeof(ppe_rect_t));
    float left = dst->x * 1.0f, right = (dst->x + dst->w - 1) * 1.0f;
    float top = dst->y * 1.0f;
    float bottom = (dst->y + dst->h - 1) * 1.0f;
    float x_min = dc->fb_width, x_max = -1;
    float *lines = (float *)image->acc_user;
    for (int i = 0; i < 4; i++)
    {
        float x = get_x(&lines[i * 3], top);
        if (x < x_min)
        {
            x_min = x;
        }
        if (x > x_max)
        {
            x_max = x;
        }
    }
    for (int i = 0; i < 4; i++)
    {
        float x = get_x(&lines[i * 3], bottom);
        if (x < x_min)
        {
            x_min = x;
        }
        if (x > x_max)
        {
            x_max = x;
        }
    }
    if (x_min > left)
    {
        new_rect->x = floor(x_min);
    }
    if (x_max < right)
    {
        new_rect->w = ceil(x_max - new_rect->x) + 1;
    }
    else
    {
        new_rect->w = right - new_rect->x + 1;
    }
}

bool acc_get_src_rect_area(ppe_rect_t *src_rect, gui_rect_t *rect)
{
    int32_t src_hor_end = src_rect->x + src_rect->w - 1;
    int32_t src_ver_end = src_rect->y + src_rect->h - 1;
    if (src_rect->x > rect->x2 || src_rect->y > rect->y2 || src_hor_end < rect->x1 ||
        src_ver_end < rect->y1)
    {
        return false;
    }
    if (src_rect->x < rect->x1)
    {
        src_rect->x = rect->x1;
    }
    if (src_rect->y < rect->y1)
    {
        src_rect->y = rect->y1;
    }
    if (src_hor_end > rect->x2)
    {
        src_hor_end = rect->x2;
    }
    if (src_ver_end > rect->y2)
    {
        src_ver_end = rect->y2;
    }
    int new_w = src_hor_end - src_rect->x + 1;
    int new_h = src_ver_end - src_rect->y + 1;
    if (new_w <= 0 || new_h <= 0)
    {
        return false;
    }
    else
    {
        src_rect->w = new_w;
        src_rect->h = new_h;
        return true;
    }
}

