realmcu/HoneyGUI/gui_engine/engine/hw_acc/rtl8773e/acc_rtk_ppe.c
void hw_acc_blit(draw_img_t *image, struct gui_dispdev *dc, struct gui_rect *rect)
{
    int32_t x_max = (image->img_target_w + image->img_target_x - 1);
    int32_t y_max = (image->img_target_h + image->img_target_y - 1);
    int32_t x_min = image->img_target_x;
    int32_t y_min = image->img_target_y;
    if (dc->section.y2 < y_min || dc->section.y1 > y_max || dc->section.x2 < x_min ||
        dc->section.x1 > x_max)
    {
        return;
    }
    if (image->opacity_value <= PPE_ACC_MIN_OPA)
    {
        return;
    }

    ppe_buffer_t target, source;
    memset(&target, 0, sizeof(ppe_buffer_t));
    memset(&source, 0, sizeof(ppe_buffer_t));
    PPE_BLEND_MODE mode = PPE_BYPASS_MODE;

    switch (dc->bit_depth)
    {
    case 16:
        target.format = PPE_RGB565;
        break;
    case 24:
        target.format = PPE_RGB888;
        break;
    case 32:
        target.format = PPE_ARGB8888;
        break;
    default:
        return;
    }
    target.address = (uint32_t)dc->frame_buf;
    target.width = dc->fb_width;
    target.height = dc->fb_height;
    target.const_color = 0;
    target.win_x_min = 0;
    target.win_x_max = target.width;
    target.win_y_min = 0;
    target.win_y_max = target.height;

    source.address = (uint32_t)image->data + sizeof(struct gui_rgb_data_head);
    source.opacity = image->opacity_value;
    source.width = image->img_w;
    source.height = image->img_h;
    struct gui_rgb_data_head *head = image->data;
    switch (head->type)
    {
    case RGB565:
        source.format = PPE_RGB565;
        break;
    case RGB888:
        source.format = PPE_RGB888;
        break;
    case ARGB8888:
        source.format = PPE_ARGB8888;
        break;
    case ARGB8565:
        source.format = PPE_ARGB8565;
        break;
    case XRGB8888:
        source.format = PPE_XRGB8888;
        break;
    default:
        return;
    }

    bool shape_transform = true;
    if (image->blend_mode == IMG_RECT)
    {
        mode = PPE_CONST_MASK_MODE;
    }
    else if ((image->matrix.m[2][2] == 1 && image->matrix.m[0][1] == 0 && \
              image->matrix.m[1][0] == 0 && image->matrix.m[2][0] == 0 && \
              image->matrix.m[2][1] == 0) || image->blend_mode == IMG_COVER_MODE)
    {
        shape_transform = false;
        if ((image->matrix.m[0][0] == 1 && image->matrix.m[1][1] == 1) || image->blend_mode == IMG_RECT)
        {
            if ((image->blend_mode == IMG_BYPASS_MODE && source.format == target.format) ||
                image->blend_mode == IMG_RECT || image->blend_mode == IMG_COVER_MODE)
            {

                if ((x_max < dc->section.x1) || (y_max < dc->section.y1)
                    || (x_min >= dc->section.x1 + dc->fb_width) || (y_min >= dc->section.y1 + dc->fb_height))
                {
                    return;
                }
                ppe_rect_t dst_rect = {.x = x_min - dc->section.x1, .y = y_min - dc->section.y1, .w = dc->fb_width, .h = dc->fb_height};
                if (dst_rect.x < 0)
                {
                    dst_rect.x = 0;
                }
                if (dst_rect.y < 0)
                {
                    dst_rect.y = 0;
                }
                if (x_max >= dc->section.x1 + dc->fb_width)
                {
                    dst_rect.w = dc->fb_width - dst_rect.x;
                }
                else
                {
                    dst_rect.w = x_max - dc->section.x1 - dst_rect.x + 1;
                }
                if (y_max >= dc->section.y1 + dc->fb_height)
                {
                    dst_rect.h = dc->fb_height - dst_rect.y;
                }
                else
                {
                    dst_rect.h = y_max - dc->section.y1 - dst_rect.y + 1;
                }
                dst_rect.x += dc->section.x1;
                dst_rect.y += dc->section.y1;
                ppe_rect_t src_rect;
                ppe_matrix_t inv_matrix;
                if (image->blend_mode == IMG_BYPASS_MODE || image->blend_mode == IMG_COVER_MODE)
                {
                    memcpy(&inv_matrix, &image->inverse, sizeof(float) * 9);
                    source.address = (uint32_t)image->data + sizeof(struct gui_rgb_data_head);
                    source.width = image->img_w;
                    source.height = image->img_h;
                    bool ret = ppe_get_area(&src_rect, &dst_rect, &inv_matrix, &source);
                    if (src_rect.w % 2)
                    {
                        src_rect.w -= 1;
                        if (src_rect.w == 0)
                        {
                            return;
                        }
                    }
                    if (!ret)
                    {
                        //DBG_DIRECT("MAT err! addr %x, section %x", image->data, dc->section_count);
                        return;
                    }
                }
                dst_rect.x -= dc->section.x1;
                dst_rect.y -= dc->section.y1;
                if (image->blend_mode == IMG_BYPASS_MODE || image->blend_mode == IMG_COVER_MODE)
                {
                    if (head->compress)
                    {
                        uint32_t s;
                        s = os_lock();
                        bare_blit_by_imdc(&target, &source, &src_rect, &dst_rect);
                        os_unlock(s);
                    }
                    else
                    {
                        uint32_t s;
                        s = os_lock();
                        bare_blit_by_dma(&target, &source, &src_rect, &dst_rect);
                        os_unlock(s);
                    }
                }
                else if (image->blend_mode == IMG_RECT)
                {
                    gui_rect_file_head_t *rect_header = (gui_rect_file_head_t *)image->data;
                    gui_color_t color;
                    color.color.argb_full = rect_header->color.color.argb_full;
                    color.color.rgba.a = rect_header->color.color.rgba.a * (image->opacity_value * 1.0f / 255);

