realmcu/HoneyGUI/gui_engine/engine/hw_acc/rtl8773e/acc_rtk_ppe.c
                    uint8_t tmp = color.color.rgba.b;
                    color.color.rgba.b = color.color.rgba.r;
                    color.color.rgba.r = tmp;
                    PPE_Mask(&target, color.color.argb_full, &dst_rect);
                }
                return;
            }
            else
            {
                mode = PPE_SRC_OVER_MODE;
            }
        }
        else if (image->blend_mode == IMG_BYPASS_MODE)
        {
            mode = PPE_BYPASS_MODE;
        }
        else if (image->blend_mode == IMG_RECT)
        {
            mode = PPE_CONST_MASK_MODE;
        }
        else if (image->blend_mode == IMG_FILTER_BLACK)
        {
            mode = PPE_SRC_OVER_MODE;
        }
        else
        {
            if (source.format >= PPE_BGR888 && source.format <= PPE_RGB565 && image->opacity_value == 0xFF)
            {
                mode = PPE_BYPASS_MODE;
            }
            else
            {
                mode = PPE_SRC_OVER_MODE;
            }
        }
    }
    else if (image->blend_mode == IMG_COVER_MODE)
    {
        mode = PPE_BYPASS_MODE;
    }
    else if (image->blend_mode == IMG_SRC_OVER_MODE || image->blend_mode == IMG_FILTER_BLACK)
    {
        mode = PPE_SRC_OVER_MODE;
    }

    if (image->blend_mode == IMG_FILTER_BLACK)
    {
        source.color_key_enable = PPE_COLOR_KEY_INSIDE;
        source.color_key_min = 0;
        source.color_key_max = 0x010101;
    }
    else if (image->blend_mode == IMG_BYPASS_MODE)
    {
        source.color_key_enable = PPE_COLOR_KEY_DISABLE;
    }
    else if (image->blend_mode == IMG_SRC_OVER_MODE)
    {
        source.color_key_enable = PPE_COLOR_KEY_DISABLE;
    }
    else if (image->blend_mode == IMG_RECT)
    {
        source.color_key_enable = PPE_COLOR_KEY_DISABLE;
    }
    else if (image->blend_mode == IMG_COVER_MODE)
    {
        source.color_key_enable = PPE_COLOR_KEY_DISABLE;
    }
    else
    {
        return;
    }
    ppe_rect_t constraint, old_rect;
    int32_t tessalation_len = PPE_TESS_LENGTH;
    uint32_t block_num = dc->fb_width / tessalation_len;
    if (dc->fb_width % tessalation_len)
    {
        block_num++;
    }
    if (image->blend_mode == IMG_RECT)
    {
        tessalation_len = dc->fb_width;
        block_num = 1;
    }

    if (shape_transform && image->acc_user != NULL)
    {
        ppe_rect_t section_rect = {.x = x_min - dc->section.x1, .y = y_min - dc->section.y1, .w = dc->fb_width, .h = dc->fb_height};
        if (section_rect.x < 0)
        {
            section_rect.x = 0;
        }
        if (section_rect.y < 0)
        {
            section_rect.y = 0;
        }
        if (x_max >= dc->section.x1 + dc->fb_width)
        {
            section_rect.w = dc->section.x1 + dc->fb_width - section_rect.x;
        }
        else
        {
            section_rect.w = x_max - dc->section.x1 - section_rect.x + 1;
        }
        if (y_max >= dc->section.y1 + dc->fb_height)
        {
            section_rect.h = dc->fb_height - section_rect.y;
        }
        else
        {
            section_rect.h = y_max - dc->section.y1 - section_rect.y + 1;
        }
        section_rect.y += dc->section.y1;
        acc_get_intersect_area(image, &constraint, &section_rect, dc);
    }
    else
    {
        constraint = (ppe_rect_t) {.x = x_min - dc->section.x1, .y = y_min - dc->section.y1, .w = dc->fb_width, .h = dc->fb_height};
        if (constraint.x < 0)
        {
            constraint.x = 0;
        }
        if (constraint.y < 0)
        {
            constraint.y = 0;
        }
        if (x_max >= dc->section.x1 + dc->fb_width)
        {
            constraint.w = dc->section.x1 + dc->fb_width - constraint.x;
        }
        else
        {
            constraint.w = x_max - dc->section.x1 - constraint.x + 1;
        }
        if (y_max >= dc->section.y1 + dc->fb_height)
        {
            constraint.h = dc->fb_height - constraint.y;
        }
        else
        {
            constraint.h = y_max - dc->section.y1 - constraint.y + 1;
        }
        constraint.y += dc->section.y1;
    }
    bool ret = false;
    if ((image->matrix.m[2][0] == 0 && image->matrix.m[2][1] == 0))
    {
        ret = ppe_get_area(&old_rect, &constraint, (ppe_matrix_t *)&image->inverse, &source);
        if (ret)
        {
            if (old_rect.w * old_rect.h * PPE_Get_Pixel_Size(source.format) < CACHE_BUF_SIZE)
            {
                block_num = 1;
                tessalation_len = dc->fb_width;
            }
        }
        else
        {
            return;
        }
    }
    for (int i = 0; i < block_num; i++)
    {
        int32_t section_x1 = tessalation_len * i;
        int32_t section_y1 = dc->section.y1;
        if (tessalation_len * (i + 1) > dc->fb_width)
        {
            tessalation_len = dc->fb_width % tessalation_len;
        }
        if ((constraint.x + constraint.w <= section_x1) || (constraint.y + constraint.h <= section_y1)
            || (constraint.x >= section_x1 + tessalation_len) || (constraint.y >= section_y1 + dc->fb_height))
        {
            continue;
        }
        source.win_x_min = 0;
        source.win_x_max = target.width;
        source.win_y_min = 0;
        source.win_y_max = target.height;
        source.address = (uint32_t)image->data + sizeof(struct gui_rgb_data_head);
        source.width = image->img_w;
        source.height = image->img_h;
        float x_ref = 0, y_ref = 0;
        ppe_rect_t ppe_rect = {0};
        memcpy(&ppe_rect, &constraint, sizeof(ppe_rect_t));
        if (block_num != 1)
        {
            if (ppe_rect.x - section_x1 < 0)
            {
                ppe_rect.x = section_x1;
            }
            if (constraint.x + constraint.w > section_x1 + tessalation_len)
            {
                ppe_rect.w = section_x1 + tessalation_len - ppe_rect.x;
            }
            else
            {
                ppe_rect.w = constraint.x + constraint.w - ppe_rect.x;
            }
        }
        ppe_matrix_t inverse;
        memcpy(&inverse, &image->inverse, sizeof(float) * 9);
        ppe_matrix_t pre_trans;
        if (mode != PPE_CONST_MASK_MODE)
        {
            if (block_num != 1)
            {
                ret = ppe_get_area(&old_rect, &ppe_rect, &inverse, &source);
                if (!ret)
                {
                    if (i == block_num - 1)
                    {
                        return;
                    }
                    else
                    {
                        continue;
                    }
                }
            }
            if (rect != NULL)
            {
                bool res = acc_get_src_rect_area(&old_rect, rect);
                if (!res)
                {
                    if (i == block_num - 1)
                    {
                        return;
                    }
                    else
                    {
                        continue;
                    }
                }
            }
            uint32_t new_cache_size = old_rect.w * old_rect.h * PPE_Get_Pixel_Size(source.format) + 4;
            if (new_cache_size < (CACHE_BUF_SIZE - last_cache_size - 4))
            {
                change_cache_buf(new_cache_size);
                last_cache_size = new_cache_size;
            }
            else if (new_cache_size < CACHE_BUF_SIZE)
            {
                PPE_Finish();
                restore_cache_buf();
                last_cache_size = new_cache_size;
            }
#if F_APP_GUI_USE_PSRAM
            else
            {
                if (head->compress)
                {
                    PPE_Finish();
                    cache_on_psram(new_cache_size);
                    last_cache_size = 0;
                }
                else
                {
                    restore_cache_buf();
                }
            }
#else
            else
            {
                if (head->compress)
                {
                    GUI_ASSERT(new_cache_size < CACHE_BUF_SIZE);
                    return;
                }
            }
#endif

