realmcu/HoneyGUI/gui_engine/engine/hw_acc/rtl8773e/acc_rtk_ppe.c
            if (head->compress)
            {
                uint32_t s = os_lock();
                ret = memcpy_by_imdc(&old_rect, &source);
                os_unlock(s);
            }
            else
            {
                uint32_t s = os_lock();
                ret = memcpy_by_dma(&old_rect, &source);
                os_unlock(s);
            }
            ppe_rect.y -= section_y1;
            if (ret)
            {
                ppe_get_identity(&pre_trans);
                pre_trans.m[0][2] = old_rect.x * -1.0f;
                pre_trans.m[1][2] = old_rect.y * -1.0f;
                ppe_mat_multiply(&pre_trans, &inverse);
                y_ref = section_y1;
                ppe_translate(0, y_ref, &pre_trans);
                memcpy(&inverse, &pre_trans, sizeof(float) * 9);
                source.width = old_rect.w;
                source.height = old_rect.h;
            }
            else
            {
                last_cache_size = 0;
                restore_cache_buf();
                if (head->compress)
                {
                    return;
                }
                if (dc->type == DC_RAMLESS)
                {
                    x_ref = 0;
                    y_ref = section_y1;
                }
                ppe_translate(x_ref, y_ref, &inverse);
            }
        }
        else
        {
            if (rect != NULL)
            {
                ppe_get_identity(&pre_trans);
                pre_trans.m[0][2] = rect->x1 * -1.0f;
                pre_trans.m[1][2] = rect->y1 * -1.0f;
                ppe_mat_multiply(&pre_trans, &inverse);
                source.width = rect->x2 - rect->x1 + 1;
                source.height = rect->y2 - rect->y1 + 1;
            }
            ppe_translate(0, dc->section.y1, &inverse);
            gui_rect_file_head_t *rect_header = (gui_rect_file_head_t *)image->data;
            gui_color_t color = {.color.argb_full = rect_header->color.color.argb_full};

            uint8_t tmp = color.color.rgba.b;
            color.color.rgba.b = color.color.rgba.r;
            color.color.rgba.r = tmp;

            color.color.rgba.a = rect_header->color.color.rgba.a * (image->opacity_value * 1.0f / 255);
            source.const_color = color.color.argb_full;
            ppe_rect.y -= dc->section.y1;
        }
        source.high_quality = image->high_quality;
        if ((image->matrix.m[0][0] == 1 && image->matrix.m[1][1] == 1 && \
             image->matrix.m[2][2] == 1 && image->matrix.m[0][1] == 0 && \
             image->matrix.m[1][0] == 0 && image->matrix.m[2][0] == 0 && \
             image->matrix.m[2][1] == 0))
        {
            source.high_quality = false;
        }
        PPE_Finish();
        PPE_err err = PPE_Blit_Inverse(&target, &source, &inverse, &ppe_rect, mode);
        if (err != PPE_SUCCESS)
        {
            DBG_DIRECT("PPE err %d", err);
//                sw_acc_blit(image, dc, rect);
        }
    }
    PPE_Finish();
}

bool hw_acc_imdc_decode(uint8_t *image, gui_rect_t *rect, uint8_t *output)
{
    if (image == NULL || rect == NULL || output == NULL)
    {
        GUI_ASSERT(image != NULL && rect != NULL && output != NULL);
        return false;
    }
    struct gui_rgb_data_head output_header;
    struct gui_rgb_data_head *head = (struct gui_rgb_data_head *)image;
    memset(&output_header, 0, sizeof(struct gui_rgb_data_head));
    const IMDC_file_header *header = (IMDC_file_header *)((uint32_t)image + sizeof(
                                                              struct gui_rgb_data_head));
    switch (head->type)
    {
    case RGB565:
        output_header.type = RGB565;
        break;
    case RGB888:
        output_header.type = RGB888;
        break;
    case ARGB8888:
        output_header.type = ARGB8888;
        break;
    case ARGB8565:
        output_header.type = ARGB8565;
        break;
    default:
        return false;
    }
    RCC_PeriphClockCmd(APBPeriph_IMDC, APBPeriph_IMDC_CLOCK, ENABLE);
    hal_imdc_decompress_info info;
    info.raw_data_address = (uint32_t)header;
    info.start_column = rect->x1;
    info.end_column = rect->x2;
    info.start_line = rect->y1;
    info.end_line = rect->y2;
    output_header.w = info.end_column - info.start_column + 1;
    output_header.h = info.end_line - info.start_line + 1;
    if (hal_imdc_decompress(&info, output + 8))
    {
        memcpy(output, &output_header, sizeof(struct gui_rgb_data_head));
        return true;
    }
    else
    {
        return false;
    }
}

void hw_acc_prepare_cb(draw_img_t *img, gui_rect_t *rect)
{
    if (img->matrix.m[2][2] != 1 || img->matrix.m[0][1] != 0 || \
        img->matrix.m[1][0] != 0 || img->matrix.m[2][0] != 0 || \
        img->matrix.m[2][1] != 0)
    {
        gui_point3f_t pox = {0.0f};
        float point[4][2];
        float *line = gui_malloc(12 * sizeof(float));
        float x1 = 0;
        float y1 = 0;
        float x2 = 0;
        float y2 = 0;

        if (rect == NULL)
        {
            x1 = 0;
            y1 = 0;
            x2 = img->img_w - 1;
            y2 = img->img_h - 1;
        }
        else
        {
            x1 = _UI_MAX(0, rect->x1);
            y1 = _UI_MAX(0, rect->y1);
            x2 = _UI_MIN(img->img_w - 1, rect->x2);
            y2 = _UI_MIN(img->img_h - 1, rect->y2);
        }

        pox.p[0] = x1;
        pox.p[1] = y1;
        pox.p[2] = 1.0f;
        matrix_multiply_point(&img->matrix, &pox);
        point[0][0] = pox.p[0];
        point[0][1] = pox.p[1];

        pox.p[0] = x2;
        pox.p[1] = y1;
        pox.p[2] = 1.0f;
        matrix_multiply_point(&img->matrix, &pox);
        point[1][0] = pox.p[0];
        point[1][1] = pox.p[1];

        pox.p[0] = x2;
        pox.p[1] = y2;
        pox.p[2] = 1.0f;
        matrix_multiply_point(&img->matrix, &pox);
        point[2][0] = pox.p[0];
        point[2][1] = pox.p[1];

        pox.p[0] = x1;
        pox.p[1] = y2;
        pox.p[2] = 1.0f;
        matrix_multiply_point(&img->matrix, &pox);

        point[3][0] = pox.p[0];
        point[3][1] = pox.p[1];

        if (point[0][0] == point[1][0])
        {
            line[0] = 1;
            line[1] = 0;
            line[2] = -point[0][0];
        }
        else if (point[0][1] == point[1][1])
        {
            line[0] = 0;
            line[1] = 1;
            line[2] = -point[0][1];
        }
        else
        {
            line[1] = -1;
            line[0] = (point[1][1] - point[0][1]) / (point[1][0] - point[0][0]);
            line[2] = point[1][1] - line[0] * point[1][0];
        }

        if (point[0][0] == point[3][0])
        {
            line[3] = 1;
            line[4] = 0;
            line[5] = -point[0][0];
        }
        else if (point[0][1] == point[3][1])
        {
            line[3] = 0;
            line[4] = 1;
            line[5] = -point[0][1];
        }
        else
        {
            line[4] = -1;
            line[3] = (point[3][1] - point[0][1]) / (point[3][0] - point[0][0]);
            line[5] = point[3][1] - line[3] * point[3][0];
        }

        if (point[2][0] == point[1][0])
        {
            line[6] = 1;
            line[7] = 0;
            line[8] = -point[2][0];
        }
        else if (point[2][1] == point[1][1])
        {
            line[6] = 0;
            line[7] = 1;
            line[8] = -point[2][1];
        }
        else
        {
            line[7] = -1;
            line[6] = (point[1][1] - point[2][1]) / (point[1][0] - point[2][0]);
            line[8] = point[1][1] - line[6] * point[1][0];
        }

        if (point[2][0] == point[3][0])
        {
            line[9] = 1;
            line[10] = 0;
            line[11] = -point[2][0];
        }
        else if (point[2][1] == point[3][1])
        {
            line[9] = 0;
            line[10] = 1;
            line[11] = -point[2][1];
        }
        else
        {
            line[10] = -1;
            line[9] = (point[3][1] - point[2][1]) / (point[3][0] - point[2][0]);
            line[11] = point[3][1] - line[9] * point[3][0];
        }
        img->acc_user = line;
    }
}

void hw_acc_end_cb(draw_img_t *image)
{
    if (image->acc_user != NULL)
    {
        gui_free(image->acc_user);
        image->acc_user = NULL;
    }
    return;
}

void hw_acc_init(void)
{
    PPE_CLK_ENABLE(ENABLE);
    uint8_t dma_channel_1, dma_channel_2;
    hal_dma_channel_init(&dma_channel_1, &dma_channel_2);
    extern void (* draw_img_acc_prepare_cb)(struct draw_img * image, gui_rect_t *rect);
    extern void (* draw_img_acc_end_cb)(struct draw_img * image);
    draw_img_acc_prepare_cb = hw_acc_prepare_cb;
    draw_img_acc_end_cb = hw_acc_end_cb;
}
